In [1]:
import pandas as pd
import numpy as np
titanic_survival = pd.read_csv('titanic_survival.csv')

In [2]:
titanic_survival.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [3]:
age = titanic_survival['age']

In [4]:
age_null_true = age[age.isnull()]
age_null_count = len(age_null_true)

In [5]:
age_null_count

264

In [6]:
pd.isnull(titanic_survival["age"]) == age.isnull()

0       True
1       True
2       True
3       True
4       True
5       True
6       True
7       True
8       True
9       True
10      True
11      True
12      True
13      True
14      True
15      True
16      True
17      True
18      True
19      True
20      True
21      True
22      True
23      True
24      True
25      True
26      True
27      True
28      True
29      True
        ...
1280    True
1281    True
1282    True
1283    True
1284    True
1285    True
1286    True
1287    True
1288    True
1289    True
1290    True
1291    True
1292    True
1293    True
1294    True
1295    True
1296    True
1297    True
1298    True
1299    True
1300    True
1301    True
1302    True
1303    True
1304    True
1305    True
1306    True
1307    True
1308    True
1309    True
Name: age, Length: 1310, dtype: bool

In [7]:
pclass = titanic_survival["pclass"]

In [8]:
titanic_survival[titanic_survival["pclass"] == 1]["fare"].mean()

87.50899164086687

In [9]:
passenger_data = titanic_survival.pivot_table(index = "pclass", values = ["age","fare"], aggfunc = np.mean)

In [10]:
passenger_data

              age       fare
pclass
1.0     39.159918  87.508992
2.0     29.506705  21.179196
3.0     24.816367  13.302889

In [11]:
port_stats = titanic_survival.pivot_table(index = "embarked", values = ["fare", "survived"], aggfunc = np.sum)

In [12]:
port_stats

                fare  survived
embarked
C         16830.7922     150.0
Q          1526.3085      44.0
S         25033.3862     304.0

In [13]:
drop_na_columns = titanic_survival.dropna(axis = 1)
new_titanic_survival = titanic_survival.dropna(axis = 0, subset = ['age','sex'])

In [41]:
new_titanic_survival = new_titanic_survival.sort_values(by = 'age', ascending = False)

When indexing multiple rows and columns, use 2 dimensional argument.

*loc uses values to find and iloc uses indices*

In [42]:
row_index_1100_age = new_titanic_survival.loc[1100,'age']
row_index_25_survived = new_titanic_survival.loc[25,'survived']
five_rows_three_cols = new_titanic_survival.iloc[:5,]

In [43]:
five_rows_three_cols

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
14,1.0,1.0,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0.0,0.0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"
61,1.0,1.0,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1.0,0.0,19877,78.8500,C46,S,6,NaN,"Little Onn Hall, Staffs"
1235,3.0,0.0,"Svensson, Mr. Johan",male,74.0,0.0,0.0,347060,7.7750,NaN,S,NaN,NaN,NaN
9,1.0,0.0,"Artagaveytia, Mr. Ramon",male,71.0,0.0,0.0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
135,1.0,0.0,"Goldschmidt, Mr. George B",male,71.0,0.0,0.0,PC 17754,34.6542,A5,C,NaN,NaN,"New York, NY"

In [44]:
titanic_reindexed = new_titanic_survival.reset_index().iloc[:,1:]

In [46]:
titanic_reindexed.iloc[:5,:3]

   pclass  survived                                               name
0     1.0       1.0               Barkworth, Mr. Algernon Henry Wilson
1     1.0       1.0  Cavendish, Mrs. Tyrell William (Julia Florence...
2     3.0       0.0                                Svensson, Mr. Johan
3     1.0       0.0                            Artagaveytia, Mr. Ramon
4     1.0       0.0                          Goldschmidt, Mr. George B

In [59]:
def null_count(column):
    count = 0
    for item in column:
        if pd.isnull(item):
            count += 1
    return count

In [61]:
column_null_count = titanic_survival.apply(null_count)

In [62]:
column_null_count

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

In [64]:
def minor(row):
    if pd.isnull(row["age"]):
        return "unknown"
    elif row["age"] < 18:
        return "minor"
    else:
        return "adult"

In [65]:
age_labels = titanic_survival.apply(minor, axis = 1)

In [69]:
titanic_survival['age_labels'] = age_labels

In [76]:
age_group_survival_numbers = titanic_survival.pivot_table(index = "age_labels", values = "survived", aggfunc = np.sum)
age_group_survival_probs = titanic_survival.pivot_table(index = 'age_labels', values = 'survived', aggfunc = np.mean)

In [77]:
age_group_survival_numbers

            survived
age_labels
adult          346.0
minor           81.0
unknown         73.0